ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/lettergeneration/request_empty_meddelelseTypeNummer.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns="http://skat.dk/begrebsmodel/2009/01/15/"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <GenerateLetterEkspres_I>
            <Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>1d79eb22-ca52-4659-85f7-e061f914c28a</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2017-07-12T13:52:03</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </Kontekst>
            <FagsystemNavn>IND</FagsystemNavn>
            <MeddelelseBatchID>416409514939896482166052446</MeddelelseBatchID>
            <Meddelelse>
                <MeddelelseIndhold>
                    <InddrivelseMeddelelseAfdragOrdningStruktur>
                        <InddrivelseForbladStruktur>
                            <InddrivelseIndtastningFelterStruktur>
                                <InddrivelseIndtastningFelterListe>
                                    <InddrivelseIndtastningFelter>
                                        <InddrivelseIndtastningFelterFritekstNummer>1
                                        </InddrivelseIndtastningFelterFritekstNummer>
                                        <InddrivelseIndtastningFelterFritekstTekst/>
                                    </InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelter>
                                        <InddrivelseIndtastningFelterFritekstNummer>2
                                        </InddrivelseIndtastningFelterFritekstNummer>
                                        <InddrivelseIndtastningFelterFritekstTekst/>
                                    </InddrivelseIndtastningFelter>
                                </InddrivelseIndtastningFelterListe>
                            </InddrivelseIndtastningFelterStruktur>
                            <AndenAktørNavn/>
                            <KanalAdresseStruktur>
                                <AdresseValg>
                                    <AlternativAdresseStruktur>
                                        <AlternativAdresse>
                                            <AlternativAdresseFortløbendeNummer/>
                                            <AlternativAdresseAnvendelseKode/>
                                            <AlternativAdresseAdresseLinie1/>
                                            <AlternativAdresseAdresseLinie2/>
                                            <AlternativAdresseAdresseLinie3/>
                                            <AlternativAdresseAdresseLinie4/>
                                            <AlternativAdresseAdresseLinie5/>
                                            <AlternativAdresseAdresseLinie6/>
                                            <AlternativAdresseAdresseLinie7/>
                                            <AlternativAdresseGyldigFra/>
                                            <AlternativAdresseGyldigTil/>
                                            <AdresseTypeKode/>
                                            <AdresseTypeTekst/>
                                            <AdresseTypeGyldigFra/>
                                            <AdresseTypeGyldigTil/>
                                            <LandKode/>
                                            <LandNavn/>
                                        </AlternativAdresse>
                                    </AlternativAdresseStruktur>
                                </AdresseValg>
                            </KanalAdresseStruktur>
                        </InddrivelseForbladStruktur>
                        <InddrivelseFordringOpgørelseStruktur>
                            <InddrivelseFordringOpgørelseSumSamletBeløb>10238.19
                            </InddrivelseFordringOpgørelseSumSamletBeløb>
                            <InddrivelseFordringOpgørelseDato>2017-05-05</InddrivelseFordringOpgørelseDato>
                            <InddrivelseSimuleretRenteStruktur>
                                <InddrivelseFordringOpgørelseSimuleretRenteDato>2017-05-19
                                </InddrivelseFordringOpgørelseSimuleretRenteDato>
                                <InddrivelseFordringOpgørelseSamletSimuleretRenteBeløb>0.0
                                </InddrivelseFordringOpgørelseSamletSimuleretRenteBeløb>
                                <InddrivelseFordringOpgørelseSumSamletInklusivSimuleretRenteBeløb>10238.19
                                </InddrivelseFordringOpgørelseSumSamletInklusivSimuleretRenteBeløb>
                            </InddrivelseSimuleretRenteStruktur>
                            <InddrivelseFordringshaverFordringerListe>
                                <InddrivelseFordringshaverFordringer>
                                    <InddrivelseFordringshaverID>3f38d0a0-dd59-4434-9535-c2e08b9c1c74
                                    </InddrivelseFordringshaverID>
                                    <PersonNavnNavn>Danmarks Radio</PersonNavnNavn>
                                    <InddrivelseFordringListe>
                                        <InddrivelseFordring>
                                            <InddrivelseFordringNiveau1ID>742a5d08-19eb-40a0-ada1-8bd02f49fea0
                                            </InddrivelseFordringNiveau1ID>
                                            <InddrivelseFordringStruktur>
                                                <InddrivelseFordringTypeTekst>Main Claim</InddrivelseFordringTypeTekst>
                                                <InddrivelseFordringPeriodeFraDato>2011-05-29
                                                </InddrivelseFordringPeriodeFraDato>
                                                <InddrivelseFordringPeriodeTilDato>2016-05-26
                                                </InddrivelseFordringPeriodeTilDato>
                                                <InddrivelseFordringStiftelseDato>2017-01-01
                                                </InddrivelseFordringStiftelseDato>
                                                <InddrivelseFordringBeskrivelse>DR-Medielicens (til DR)
                                                </InddrivelseFordringBeskrivelse>
                                                <InddrivelseFordringBeløb>10000.0</InddrivelseFordringBeløb>
                                            </InddrivelseFordringStruktur>
                                            <SumBeløbInklusiveRelateredeFordringer>
                                                <InddrivelseFordringSumBeløb>10238.19</InddrivelseFordringSumBeløb>
                                            </SumBeløbInklusiveRelateredeFordringer>
                                            <InddrivelseRelateretFordringNiveau2Liste>
                                                <InddrivelseRelateretFordringNiveau2>
                                                    <InddrivelseFordringNiveau2ID>d89aebfe-8d32-4bfa-a21d-5cbf560d4824
                                                    </InddrivelseFordringNiveau2ID>
                                                    <InddrivelseRelateretFordringStruktur>
                                                        <InddrivelseRelateretFordringTypeTekst>Interest imposed by RIM
                                                        </InddrivelseRelateretFordringTypeTekst>
                                                        <InddrivelseRelateretFordringPeriodeFraDato>2017-02-01
                                                        </InddrivelseRelateretFordringPeriodeFraDato>
                                                        <InddrivelseRelateretFordringPeriodeTilDato>2017-05-19
                                                        </InddrivelseRelateretFordringPeriodeTilDato>
                                                        <InddrivelseRelateretFordringStiftelseDato>2017-01-01
                                                        </InddrivelseRelateretFordringStiftelseDato>
                                                        <InddrivelseRelateretFordringBeskrivelse>DR-Medielicens (til
                                                            DR)
                                                        </InddrivelseRelateretFordringBeskrivelse>
                                                        <InddrivelseRelateretFordringBeløb>238.19
                                                        </InddrivelseRelateretFordringBeløb>
                                                    </InddrivelseRelateretFordringStruktur>
                                                    <InddrivelseRelateretFordringNiveau3Liste/>
                                                </InddrivelseRelateretFordringNiveau2>
                                            </InddrivelseRelateretFordringNiveau2Liste>
                                        </InddrivelseFordring>
                                    </InddrivelseFordringListe>
                                </InddrivelseFordringshaverFordringer>
                            </InddrivelseFordringshaverFordringerListe>
                        </InddrivelseFordringOpgørelseStruktur>
                        <InddrivelseIndtastningFelterStruktur>
                            <InddrivelseIndtastningFelterListe>
                                <InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelterFritekstNummer>1
                                    </InddrivelseIndtastningFelterFritekstNummer>
                                    <InddrivelseIndtastningFelterFritekstTekst>(DATO)
                                    </InddrivelseIndtastningFelterFritekstTekst>
                                </InddrivelseIndtastningFelter>
                                <InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelterFritekstNummer>2
                                    </InddrivelseIndtastningFelterFritekstNummer>
                                    <InddrivelseIndtastningFelterFritekstTekst>(DATO)
                                    </InddrivelseIndtastningFelterFritekstTekst>
                                </InddrivelseIndtastningFelter>
                                <InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelterFritekstNummer>3
                                    </InddrivelseIndtastningFelterFritekstNummer>
                                    <InddrivelseIndtastningFelterFritekstTekst>(BEGRUNDELSE)
                                    </InddrivelseIndtastningFelterFritekstTekst>
                                </InddrivelseIndtastningFelter>
                                <InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelterFritekstNummer>4
                                    </InddrivelseIndtastningFelterFritekstNummer>
                                    <InddrivelseIndtastningFelterFritekstTekst>(IKKE KAN GODKENDES, denne er byttet
                                        rundt og comitted)
                                    </InddrivelseIndtastningFelterFritekstTekst>
                                </InddrivelseIndtastningFelter>
                                <InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelterFritekstNummer>5
                                    </InddrivelseIndtastningFelterFritekstNummer>
                                    <InddrivelseIndtastningFelterFritekstTekst>(DELVIS GODKENDES, denne er byttet rundt
                                        og comitted)
                                    </InddrivelseIndtastningFelterFritekstTekst>
                                </InddrivelseIndtastningFelter>
                                <InddrivelseIndtastningFelter>
                                    <InddrivelseIndtastningFelterFritekstNummer>6
                                    </InddrivelseIndtastningFelterFritekstNummer>
                                    <InddrivelseIndtastningFelterFritekstTekst>(ØVRIGE OPLYSNINGER)
                                    </InddrivelseIndtastningFelterFritekstTekst>
                                </InddrivelseIndtastningFelter>
                            </InddrivelseIndtastningFelterListe>
                        </InddrivelseIndtastningFelterStruktur>
                        <BetalingEvne>
                            <Forsørgerpligt>
                                <CivilstandForsørgerPligt>false</CivilstandForsørgerPligt>
                            </Forsørgerpligt>
                            <InddrivelseBetalingEvneStruktur>
                                <BetalingEvneProcent/>
                                <BetalingEvneÅrligBeløb/>
                                <BetalingEvneMånedBeløb>650.00</BetalingEvneMånedBeløb>
                            </InddrivelseBetalingEvneStruktur>
                            <SammenligningAfIndkomstMånedÅr>
                                <InddrivelseIndkomstForholdKode/>
                                <AnvendtIndkomstMånedÅr>
                                    <InddrivelseLønEindkomstStruktur>
                                        <INDLønEindkomstMånedÅr/>
                                        <INDLønEindkomstMånedBeløb/>
                                    </InddrivelseLønEindkomstStruktur>
                                </AnvendtIndkomstMånedÅr>
                                <FørsteIndkomstMånedÅr>
                                    <InddrivelseLønEindkomstStruktur>
                                        <INDLønEindkomstMånedBeløb/>
                                    </InddrivelseLønEindkomstStruktur>
                                    <IndkomstTypeKode/>
                                </FørsteIndkomstMånedÅr>
                                <AndenIndkomstMånedÅr>
                                    <InddrivelseLønEindkomstStruktur>
                                        <INDLønEindkomstMånedBeløb/>
                                    </InddrivelseLønEindkomstStruktur>
                                    <IndkomstTypeKode/>
                                </AndenIndkomstMånedÅr>
                                <Årsopgørelse>
                                    <IndkomstÅr/>
                                    <ÅrsopgørelseOpgørelseNummer/>
                                    <INDÅrsopgørelseÅrIndkomstNettoBeløb/>
                                </Årsopgørelse>
                            </SammenligningAfIndkomstMånedÅr>
                        </BetalingEvne>
                        <InddrivelseFristOgGebyr>
                            <PåkravSenestePartshøringOgSidsteRettidigBetallingDato>2017-05-19
                            </PåkravSenestePartshøringOgSidsteRettidigBetallingDato>
                            <PåkravSidsteRettidigBetalingDato>2017-05-05</PåkravSidsteRettidigBetalingDato>
                            <PåkravPartshøringFristDato>2017-05-19</PåkravPartshøringFristDato>
                            <InddrivelseMeddelelseValgHarModtagetInfoOmPersonoplysninger>true
                            </InddrivelseMeddelelseValgHarModtagetInfoOmPersonoplysninger>
                        </InddrivelseFristOgGebyr>
                        <OCRLinieStruktur>
                            <IND_OCRLinjeType>Her kommer OCR linjen til at være i det endelige brev</IND_OCRLinjeType>
                        </OCRLinieStruktur>
                        <Skyldner>
                            <SkyldnerSendInfoOmPersonoplysninger>true</SkyldnerSendInfoOmPersonoplysninger>
                        </Skyldner>
                        <InddrivelseAfdragsordning>
                            <AfdragBeløb>650.00</AfdragBeløb>
                            <AfdragFrekvens>måned</AfdragFrekvens>
                            <FørsteAfdragDato>2017-07-02</FørsteAfdragDato>
                            <AfdragOrdningID>27959215046989</AfdragOrdningID>
                            <AfdragOrdningType>PAB</AfdragOrdningType>
                            <KulanceUdløbDato>2018-05-15</KulanceUdløbDato>
                        </InddrivelseAfdragsordning>
                    </InddrivelseMeddelelseAfdragOrdningStruktur>
                </MeddelelseIndhold>
                <MeddelelseTypeNummer></MeddelelseTypeNummer>
                <MeddelelseAfsenderReference>08987960730000000089879629020170505</MeddelelseAfsenderReference>
                <KundeNummer>0505771168</KundeNummer>
                <MeddelelseOprettetAfMedarbejder>HL</MeddelelseOprettetAfMedarbejder>
                <KanalTypeNummer>3</KanalTypeNummer>
                <KanalAdresseNavn>
                    <KundeNavn>SKAT Inddrivelse Test Person 140</KundeNavn>
                </KanalAdresseNavn>
                <KanalAdresseStruktur>
                    <AdresseValg>
                        <AlternativAdresseStruktur>
                            <AlternativAdresse>
                                <AlternativAdresseFortløbendeNummer>0</AlternativAdresseFortløbendeNummer>
                                <AlternativAdresseAnvendelseKode>0</AlternativAdresseAnvendelseKode>
                                <AlternativAdresseAdresseLinie1>Nordre Strandvej 12</AlternativAdresseAdresseLinie1>
                                <AlternativAdresseAdresseLinie2>3000 Helsingør</AlternativAdresseAdresseLinie2>
                                <AdresseTypeKode>0</AdresseTypeKode>
                                <LandKode>DK</LandKode>
                            </AlternativAdresse>
                        </AlternativAdresseStruktur>
                    </AdresseValg>
                </KanalAdresseStruktur>
                <MeddelelseTypeSkalIKommunikationMappe>true</MeddelelseTypeSkalIKommunikationMappe>
                <Filer/>
            </Meddelelse>
        </GenerateLetterEkspres_I>
    </soapenv:Body>
</soapenv:Envelope>
